# todo: Определить в коде переменные:
# 1. Целочисленного типа
# 2. Вещественного типа
# 3. Логического типа
# 4. Строкового типа
# 5. Пустого типа
# Вывести их типы.
a = 2
b = 2.2
c = True
d = '6'
e = None
print(type(a))
print(type(b))
print(type(c))
print(type(d))
print(type(e))